In [1]:
import pandas as pd
import numpy as np

In [2]:
data={
    'Name':["Arul","Hepzi","Beulah","Ann","Rezia","Bobby","Abraham"],
'Age':[20,10,30,40,50,60,10],
'Gender':['Male','Female','Female','Female','Female','Male','Male'],
'Salary':[50000,20000,40000,30000,50000,60000,50000]}

df=pd.DataFrame(data)
df

      Name  Age  Gender  Salary
0     Arul   20    Male   50000
1    Hepzi   10  Female   20000
2   Beulah   30  Female   40000
3      Ann   40  Female   30000
4    Rezia   50  Female   50000
5    Bobby   60    Male   60000
6  Abraham   10    Male   50000

In [3]:
####'Name' and 'Age' columns for individuals with age greater than 30.
subset=df[df['Age']> 30]
print(subset)

    Name  Age  Gender  Salary
3    Ann   40  Female   30000
4  Rezia   50  Female   50000
5  Bobby   60    Male   60000

In [4]:
######Filter the rows where 'Gender' is 'Male' and 'Salary' is greater than 5000

subset1=df[(df['Gender']=='Male') & (df['Salary']>5000)]
subset1

      Name  Age Gender  Salary
0     Arul   20   Male   50000
5    Bobby   60   Male   60000
6  Abraham   10   Male   50000

In [5]:
####Extract the rows where 'Name' starts with the letter 'S'.
subset2=df[df['Name'].str.startswith('S')]

In [6]:
data1 = {
    'Product': ['Electronics', 'Furniture', 'Electronics', 'Clothing', 'Furniture', 'Electronics', 'Clothing'],
    'Region': ['North', 'South', 'East', 'West', 'North', 'South', 'North'],
    'Sales': [1500, 700, 1200, 500, 800, 950, 2000]
}

In [7]:
df1=pd.DataFrame(data1)
df1

       Product Region  Sales
0  Electronics  North   1500
1    Furniture  South    700
2  Electronics   East   1200
3     Clothing   West    500
4    Furniture  North    800
5  Electronics  South    950
6     Clothing  North   2000

In [8]:
#Retrieve the sales data for the 'Electronics' product category.
electronics = df1[df1['Product'] == 'Electronics']
print(electronics)

       Product Region  Sales
0  Electronics  North   1500
2  Electronics   East   1200
5  Electronics  South    950

In [9]:

 #Filter the data for the 'North' region and where 'Sales' are less than 1000.
sales=df1[(df1['Region']=='North')&(df1['Sales']<1000)]
sales

     Product Region  Sales
4  Furniture  North    800

In [10]:
##Select the rows where 'Sales' are above the mean sales value.
df

      Name  Age  Gender  Salary
0     Arul   20    Male   50000
1    Hepzi   10  Female   20000
2   Beulah   30  Female   40000
3      Ann   40  Female   30000
4    Rezia   50  Female   50000
5    Bobby   60    Male   60000
6  Abraham   10    Male   50000

In [11]:
students={
    'Student_ID':[1,2,3,4,5,6,7],
'Name':['Alan','wesley','John','Peter','Rezia','Kelan','Joel'],
'Subject':['history','English','Math','Tamil','Accounts','English','English'],
    'Grade':['A','B','C','A','A','C','D']}

In [12]:
students

{'Student_ID': [1, 2, 3, 4, 5, 6, 7],
 'Name': ['Alan', 'wesley', 'John', 'Peter', 'Rezia', 'Kelan', 'Joel'],
 'Subject': ['history',
  'English',
  'Math',
  'Tamil',
  'Accounts',
  'English',
  'English'],
 'Grade': ['A', 'B', 'C', 'A', 'A', 'C', 'D']}

In [13]:
df2=pd.DataFrame(students)
df2

   Student_ID    Name   Subject Grade
0           1    Alan   history     A
1           2  wesley   English     B
2           3    John      Math     C
3           4   Peter     Tamil     A
4           5   Rezia  Accounts     A
5           6   Kelan   English     C
6           7    Joel   English     D

In [14]:
####Extract the information for students with a 'Grade' of 'A' in 'Math'.

sub_student=df2[(df2['Grade']=='A')&(df2['Subject']=='Math')]
sub_student

Empty DataFrame
Columns: [Student_ID, Name, Subject, Grade]
Index: []

In [32]:
data2={
    'car':['bmw'],
    'model':[1975]}

car=pd.DataFrame

{'car': ['bmw'], 'model': [1975]}